app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", ""]]
---
  def similar
    @movie = Movie.find(params[:id])
    if not @movie.director.empty?